// /** @file
// Library description file for BaseSerialPortLib16550 module.
//
// ******************************************************************************
// * Copyright 2019 Insyde Software Corp. All Rights Reserved.
// *
// * You may not reproduce, distribute, publish, display, perform, modify, adapt,
// * transmit, broadcast, present, recite, release, license or otherwise exploit
// * any part of this publication in any form, by any means, without the prior
// * written permission of Insyde Software Corp.
// *
// ******************************************************************************
//
// **/
// /** @file
// SerialPortLib instance for 16550 UART.
//
// SerialPortLib instance for 16550 UART.
//
// Copyright (c) 2006 - 2014, Intel Corporation. All rights reserved.<BR>
//
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// **/


#string STR_MODULE_ABSTRACT             #language en-US "SerialPortLib instance for 16550 UART"

#string STR_MODULE_DESCRIPTION          #language en-US "SerialPortLib instance for 16550 UART."

